[{"content":"Details AVS Reservations AVS NSX-T NVA Architectures AVS Internet Access Architectures VMware References AVS Sales YouTube Channel AVS Marketing YouTube Channel AVS Hands On Lab VMware AVS Techzone AVS and VMware Service Support KB Azure References Azure Documentation Azure AVS Network Connectivity Models NetApp References Azure NetApp File Performance Calculator ","date":1658374116,"description":"","lastmod":"2022-07-20T23:28:36-04:00","objectID":"3189aad2e0c273f079ab2df4fedf755d","permalink":"https://sjainout.github.io/cloud/avs/","publishdate":"2022-07-20T23:28:36-04:00","title":"Azure VMware Solution"},{"content":"There are 3 broad exit points for Internet access for VMs sitting inside of AVS:\nDirectly from AVS From Azure Region From On-Prem Further subdividing the categories:\nDirectly from AVS using SNAT using Public IP From Azure Region using Azure vWAN Hub with Global Reach using Azure vNet with Global Reach using Azure vWAN Hub without Global Reach using Azure vNet without Global Reach From On-Prem existing on-prem DMZ ","date":1658523964,"description":"","lastmod":"2022-07-22T17:06:04-04:00","objectID":"c2fab20edbb75cfa88bc7ad6c7603535","permalink":"https://sjainout.github.io/cloud/avs/avs_internet_access/","publishdate":"2022-07-22T17:06:04-04:00","title":"AVS Internet Access Architecture Options"},{"content":"Customer can deploy self-managed NVAs like FireWall, Loadbalancer, etc, inside of AVS Private Cloud. From NSX-T\u0026amp;rsquo;s point of view it is just another Virtual Machine (VM).\nHere, NVA has to be in routed path, where, it acts as network gateway for the layer 3 segment. From scale point of view, ESXi supports 10 network interfaces per VM. 1 interface can be used for uplink 1 for management 1 for ha 7 segments are then left to create security zones. Security zone in these options can either be \u0026amp;lsquo;a segment\u0026amp;rsquo; or \u0026amp;lsquo;an isolated NSX-T T1 gateway\u0026amp;rsquo; On the main NSX-T T1, configure a summary static route for all the south-bound segments with next hop set to NVA. On the isolated NSX-T T1s, configure default static route using 0.0.0.0/1, 128.0.0.0/1 with NVA as the next-hop. ","date":1658520798,"description":"","lastmod":"2022-07-22T16:13:18-04:00","objectID":"21bedfc40f646dd21d66b5a5ce6957f2","permalink":"https://sjainout.github.io/cloud/avs/avs_nsxt_nva_architectures/","publishdate":"2022-07-22T16:13:18-04:00","title":"AVS NSXT NVA Architectures"},{"content":"Azure VMware Solution (AVS) Host Reservation Introduction AVS host by default are created using on-demand billing rates but if Reserved Instance (RI) for AVS host is purchased then customer can reduce the overall billing commitment.\nAzure AVS Reserved Instance Documentation covers 2 routes:\nBuy Reserved Instances for an Enterprise Agreement (EA) subscription Buy Reserved Instances for a Cloud Solution Provider (CSP) subscription Requirements AVS Subscription value AVS Region Reservation duration: 1 year or 3 years Payment duration: upfront or monthly Number of hosts to reserve User purchasing the reservation should have at least one of these roles: 1. Owner 2. Reservation Purchase Sample execution steps Deploy AVS with necessary hosts Log in to Azure portal with Owner credentials Go to \u0026amp;lsquo;Reservation\u0026amp;rsquo; page on Azure Portal 1. One method is to go to search bar and type in ‘Reservation’ Select \u0026amp;lsquo;Purchase\u0026amp;rsquo; Select \u0026amp;lsquo;Azure VMware Solution\u0026amp;rsquo; Leave scope to default value of \u0026amp;lsquo;shared\u0026amp;rsquo; Set \u0026amp;lsquo;Billing subscription\u0026amp;rsquo; ID to same as AVS\u0026amp;rsquo;s subscription Set \u0026amp;lsquo;Region\u0026amp;rsquo; Set \u0026amp;lsquo;Term\u0026amp;rsquo; Set \u0026amp;lsquo;Billing frequency\u0026amp;rsquo; Select \u0026amp;lsquo;Row\u0026amp;rsquo; and \u0026amp;lsquo;Add to cart\u0026amp;rsquo; Select \u0026amp;lsquo;Review + Buy\u0026amp;rsquo; Check final reservation state (Succeeded) FAQ Can there be multiple reservations for a given subscription account? yes Open questions Can reservation subcription be changed? Can reservation region be changed? Can reservation duration be changed? Can reservation host type be changed? Can reservation be canceled? ","date":1658370754,"description":"","lastmod":"2022-07-20T22:32:34-04:00","objectID":"852bedf6281525ff2a4ddad5a862f854","permalink":"https://sjainout.github.io/cloud/avs/avs_reservation/","publishdate":"2022-07-20T22:32:34-04:00","title":"AVS Reservation"},{"content":"Details AVS HCX Install On-prem HCX Connector Install HCX network migration HCX VM and Network migration demo References HCX Documentation HCX Design : Blogs by HCX experts Network Bandwidth Calculator ","date":1658374126,"description":"","lastmod":"2022-07-20T23:28:46-04:00","objectID":"f6e49a94a31e5aeee35d779a4c76a66b","permalink":"https://sjainout.github.io/cloud/hcx/","publishdate":"2022-07-20T23:28:46-04:00","title":"Migration"},{"content":"AVS side HCX Manager Deployment Information AVS HCX Deployment\nOn-Prem side HCX Pre-Deployment Information Deployment details On-prem HCX install requirements On-prem HCX ports On-prem HCX IP requirements: 4x IP Addresses for HCX Appliances 3x management IPs 1x will be for the HCX Manager 1x will be for each Interconnect Appliance for Migration 1x will be for each Network Extension Appliance 1x vMotion IP for each Interconnect Appliance if vMotion network is isolated (optional) DNS A record is needeed for on-prem HCX connector to map it’s static IP with it\u0026amp;rsquo;s FQDN name Additional details which will be needed during deployment and configuration: vCenter URL PSC URL vCenter admin credentials DNS Server IP NTP Server IP Proxy Server (optional) Storage for HCX deployment Cluster w/ test workload VMs vDS w/ Port Group for L2 extension (Optional) On-Prem NSX requirement for HCX deployment (Optional) Network Extension Requirement (Optional) Network Extension Restrictions ","date":1658370803,"description":"","lastmod":"2022-07-20T22:33:23-04:00","objectID":"2d5d75d981e303402ff30ddf74387c08","permalink":"https://sjainout.github.io/cloud/hcx/hcx_avs_install/","publishdate":"2022-07-20T22:33:23-04:00","title":"HCX AVS Install"},{"content":"VMware\u0026amp;rsquo;s Hybrid Cloud eXtension (HCX) platform can be used to:\nMigrate Virtual Machine from source datacenter to AVS Migrate Network segment from source datacenter to AVS In this article we\u0026amp;rsquo;ll explore steps which can be taken to seemlessly migrate network from VMware based source datacenter over to AVS.\nNetwork Migration States We\u0026amp;rsquo;ll explore the transition with the following states:\nInitial State: where source datacenter has network connection to AVS private cloud. Intermediate Network Extension State: where a layer 2 network segment has been extended to AVS. Intermediate Optimized Local Routing State (Optional): where local smart routing is enabled within AVS. Final Network Migration State: where network gateway is migrated to AVS. Initial State On-Prem Routing advertisement subnet: 10.10.10.0/24 Network gateway: 10.10.10.1 AVS Routing advertisement subnet: 10.20.20.0/24 Network gateway: 10.20.20.1 HCX Administrator action: deploy HCX Intermediate Network Extension State On-Prem Routing advertisement subnet: 10.10.10.0/24 Network gateway: 10.10.10.1 AVS Routing advertisement subnet: 10.20.20.0/24 Network gateway: 10.20.20.1 HCX Network extension: 10.10.10.0/24 Network gateway: 10.10.10.1 Network gateway location: On-Prem Mobility optimized networking: not enabled AVS NSX-T1 segment attachment: not enabled Administrator action: extend 10.10.10.0/24 network to AVS Administrator action: migrate all VMs in 10.10.10.0/24 network to extended network in AVS Intermediate Optimized Local Routing State (Optional) On-Prem Routing advertisement subnet: 10.10.10.0/24 Network gateway: 10.10.10.1 AVS Routing advertisement subnet: 10.20.20.0/24 Network gateway: 10.20.20.1 Routing advertisement subnet: 10.10.10.13/32 HCX Network extension: 10.10.10.0/24 Network gateway: 10.10.10.1 Network gateway location: On-Prem Mobility optimized networking: enabled AVS NSX-T1 segment attachment: enabled AVS NSX-T1 VM attachement: 10.10.10.13 Administrator action: enable MON on …","date":1675723144,"description":"","lastmod":"2023-02-06T17:39:04-05:00","objectID":"6c8785e4779201dd19e47eb87c65b7e3","permalink":"https://sjainout.github.io/cloud/hcx/hcx_network_migrate/","publishdate":"2023-02-06T17:39:04-05:00","title":"Migrate Network with HCX"},{"content":"Documentation\nlogin to cloud HCX manager get cloud HCX manager URL AVS \u0026amp;gt; Add-ons \u0026amp;gt; Migration using HCX \u0026amp;gt; HCX Cloud Manager IP get cloud HCX manager login credentials AVS \u0026amp;gt; Identity \u0026amp;gt; vCenter \u0026amp;gt; Admin username AVS \u0026amp;gt; Identity \u0026amp;gt; vCenter \u0026amp;gt; Admin password\n(do not select \u0026amp;lsquo;Generate a new password\u0026amp;rsquo;)\nopen browser to cloud HCX manager Use the IP, username and password gathered from earlier steps to go to https:// download on-prem HCX Connector OVA request download link HCX \u0026amp;gt; Administrator \u0026amp;gt; System Updates\nwait for few minutes for link to show up\nSelect \u0026amp;lsquo;Request Download Link\u0026amp;rsquo;\nstart download Select \u0026amp;lsquo;VMware HCX\u0026amp;rsquo; to start the download OR Select \u0026amp;lsquo;Copy Link\u0026amp;rsquo; to save the download URL ","date":1658753443,"description":"","lastmod":"2022-07-25T08:50:43-04:00","objectID":"2600b3b1ff9edf2e16847eff4c272449","permalink":"https://sjainout.github.io/cloud/hcx/hcx_on_prem_download/","publishdate":"2022-07-25T08:50:43-04:00","title":"HCX On-Prem Connector OVA Download"},{"content":"This document covers lab demo covering following sequence of steps:\nExtend network from on-prem to AVS Migrate VM from on-prem to AVS Enable Mobility Optimized Networking in AVS Migrate network segment in AVS Management Lab environment has been setup with the following:\nExpress Route connection between on-prem (Chicago) and AVS (Azure USA West region) HCX deployment in both on-prem and AVS HCX site pair between on-prem and AVS Network Extension Demo video contains the following:\nExtend vlan 1193 from on-prem to AVS Use on-prem gateway as default VM Migration Demo video contains the following:\nMigrate VM from on-prem to AVS VM is mapped to extended network using same IP Verify reachability to on-prem GW over network extension tunnel Verify reachability to other VM in same AVS via network extension tunnel Check AVS NSX-T settings Mobility Optimized Networking Demo video contains the following:\nEnable HCX mobility optimized networking (MON) for extended vlan Enable HCX MON for pre-migrated VM Verify reachability to on-prem GW over network extension tunnel Verify reachability to other VM in same AVS with direct local switching Check AVS NSX-T settings Network Migration Demo video contains the following:\nUnextend network segment in AVS to convert extended segment to local AVS layer 3 segment Verify reachability to on-prem GW and other VM in same AVS Check NSX-T routes Additional step required:\nManually remove on-prem GW configuration (not shown in video) ","date":1678717055,"description":"","lastmod":"2023-03-13T10:17:35-04:00","objectID":"01c89a0e52f699c7ddd2a2522551cf0a","permalink":"https://sjainout.github.io/cloud/hcx/hcx_vm_network_migrate_demo/","publishdate":"2023-03-13T10:17:35-04:00","title":"Migrate VM and Network - Lab Demo"},{"content":"Details Horizon AVS Network Design References Horizon AVS Architecture Techzone Horizon Architecture Techzone Horizon Troubleshooting Techzone Horizon Azure documentation ","date":1677507540,"description":"","lastmod":"2023-02-27T09:19:00-05:00","objectID":"88dc03a223b0a8faaebae7a5cd725205","permalink":"https://sjainout.github.io/cloud/horizon/","publishdate":"2023-02-27T09:19:00-05:00","title":"Horizon Virtual Desktop in AVS"},{"content":"Horizon AVS Network Design Options Premise: Horizon in AVS uses hybrid architecture, where,\nHorizon shared services are installed in Azure vNet Horizon desktops are installed in AVS This post covers only the following designs:\nHorizon desktop access Internet via vNet Horizon desktop access Internet directly via AVS Horizon desktop access Internet via vNet AVS Network Connections:\nOn-prem to Azure region using WAN Express Route AVS to On-Prem using Express Route Global Reach AVS to Hub vNet via local Express Route circuit Azure Network Connections:\nOn-Prem to Azure region using WAN Express Route terminating in Hub vNet Infrastructure Shared services in spoke vNet connected to hub vNet via vNet Peering Horizon Shared services in spoke vNet connected to hub vNet via vNet Peering Azure Hub vNet details:\nExpress route gateway setup to establish connection to both AVS and on-prem NVA setup for internet and network security Azure Route Server setup BGP connection with NVA NVA advertises 0.0.0.0/0 to Azure Route Server On-prem WAN Edge router discards 0.0.0.0/0 advertisement coming from Azure region vNet peering connection to Horizon shared services vNet vNet peering connection to Infrastructure shared services vNet Traffic flows:\nOn-prem end-user access \u0026amp;gt; WAN Express Route \u0026amp;gt; Hub vNet \u0026amp;gt; Horizon spoke vNet \u0026amp;gt; Horizon Connection Server Internet end-user access \u0026amp;gt; vNet NVA \u0026amp;gt; vNet Peering \u0026amp;gt; Horizon vNet \u0026amp;gt; Load Balancer \u0026amp;gt; UAG Horizon shared services \u0026amp;gt; vNet Peering \u0026amp;gt; Spoke vNet \u0026amp;gt; AD Horizon shared services \u0026amp;gt; vNet Peering \u0026amp;gt; Hub vNet \u0026amp;gt; local express route circuit to AVS \u0026amp;gt; Horizon desktop Horizon shared services \u0026amp;gt; vNet Peering \u0026amp;gt; Hub vNet \u0026amp;gt; NVA \u0026amp;gt; Internet Horizon shared services \u0026amp;gt; vNet Peering \u0026amp;gt; Hub vNet \u0026amp;gt; WAN express route \u0026amp;gt; on-prem end-user Horizon desktop \u0026amp;gt; AVS express route global reach \u0026amp;gt; on-prem end-user Horizon desktop \u0026amp;gt; AVS express route to hub vNet \u0026amp;gt; NVA \u0026amp;gt; Internet based end-user Horizon …","date":1677511012,"description":"","lastmod":"2023-02-27T10:16:52-05:00","objectID":"c14c1a9804ae7e2d7e9675523e029e9a","permalink":"https://sjainout.github.io/cloud/horizon/horizon_avs_network_design/","publishdate":"2023-02-27T10:16:52-05:00","title":"Horizon AVS Network Designs"},{"content":"Details SRM AVS Install Application DR and Backup Recovery Architecture Application DR using Same IP Architecture Options Application DR - Lab Demo References SRM Documentation SRM Ports ","date":1658418488,"description":"","lastmod":"2022-07-21T11:48:08-04:00","objectID":"bcb9add3a9286bb4d682eabf1926dd3a","permalink":"https://sjainout.github.io/cloud/srm/","publishdate":"2022-07-21T11:48:08-04:00","title":"Disaster Recovery"},{"content":"AVS side DR AVS DR w/ VMware\u0026amp;rsquo;s SRM Installation Information\nOn-Prem side DR vSphere Replication install guide\nSite Recovery Manager (SRM) network ports\nSite Recovery Manager (SRM) network ports - alternate view\nSRM appliance install guide\n","date":1658418089,"description":"","lastmod":"2022-07-21T11:41:29-04:00","objectID":"ac44edcb3cf486d5ab191b636de46929","permalink":"https://sjainout.github.io/cloud/srm/srm_avs_install/","publishdate":"2022-07-21T11:41:29-04:00","title":"SRM AVS Install"},{"content":"This document covers how the following three options can be used to protect applications:\nApplication High Availability Disaster Recovery Backup Recovery Steady State Application Requirement and Data synchronization platform Tier 0\nRecovery Time Objective (RTO): 0; Recovery Point Objective (RPO): 0 Example: Shared services (Active Directory, Network Firewall, Load Balancer) Synchronization: Application platform-based replication (active-active) Storage: Integrated Tier 1\nRTO: minutes; RPO: seconds Example: Financial and Business critical applications Synchronization: Application platform-based replication (active-standby) Storage: Integrated (AV36) Tier 2\nRTO: hours; RPO: minutes Example: Production applications Synchronization: DR platform-based replication Storage: Integrated (AV36) Tier 3\nRTO: hours; RPO: hours Example: Test applications Synchronization: DR platform-based replication Storage: Network mounted (ANF) Tier 4\nRTO: days; RPO: daily Example: Development applications Synchronization: Backup platform-based replication Storage: External (Blob) Recommended Actions Deploy sufficient AVS hosts for: Tier 0 applications Tier 1 applications Tier 2 storage placeholders Setup Disaster Recovery platforms to continuously replicate data for: Tier 2 applications Tier 3 applications (check to see which DR platforms support this) Setup Backup platforms to periodically replicate data to Blob storage for: Tier 2 - 4 applications Recovery Test: Periodically conduct DR and Backup Recovery test Isolated network environment can be setup using NSX-t in AVS Recovery State Application Recovery Sequence Tier 0\nRecovery is immediate (active) Recovery Platform: Application HA Tier 1\nRecovery is in seconds (standby \u0026amp;gt; active) Recovery Platform: Application HA Tier 2\nRecovery is in minutes (DR placeholder \u0026amp;gt; guest OS bootup) Recovery Platform: DR Infrastructure Expansion\nAdd new AVS host(s) to vSAN clusters (hours) for Tier 3 - 4 Tier 3\nRecovery is in hour(s) (DR placeholder \u0026amp;gt; …","date":1666792577,"description":"","lastmod":"2022-10-26T09:56:17-04:00","objectID":"2b2af456c04dc1261fd55ac1d22a7a52","permalink":"https://sjainout.github.io/cloud/srm/srm_dr_backup_architecture/","publishdate":"2022-10-26T09:56:17-04:00","title":"HA, DR, plus Backup Architecture"},{"content":"This document covers lab demo covering following sequence of steps:\nProtect application for disaster Test recovery application in isolated network Migrate application to recovery site Recover application and network on disaster Application Protection Demo video contains the following:\nSetup inventory parameters between protected and recovery sites. Setup Application Replication with RPO value. Application DR Test Demo video contains the following:\nExecute DR Test in isolated network environment at Recovery site. Verify application is still running in Protected site. Application DR Migrate Demo video contains the following:\nExecute application DR Migration to Recovery site. Verify application can reach all the other VMs in Protected and Recovery sites. Reprotect application back to original Protected site. Application and Network Recocery on Disaster Demo video contains the following:\nAssume Protected site is no longer reachable. Execute DR Event from SRM in Recovery site. Unextend the network from HCX in Recovery site. Verify application can reach all the other VMs in Recovery site. ","date":1679352963,"description":"","lastmod":"2023-03-20T18:56:03-04:00","objectID":"95c630b04c069c0a6c15975ecd9a72ef","permalink":"https://sjainout.github.io/cloud/srm/srm_dr_functions_demo/","publishdate":"2023-03-20T18:56:03-04:00","title":"Application DR - Lab Demo"},{"content":"DR steady state Protected site: On-Prem Recovery site: AVS DR Platform: VMware Site Recovery Protected VMs: 3 On-Prem VMs replicated in SRM Port Group (PG) Placeholder VMs: 3 AVS placeholder VMs created on recovery site and kept up to date DR Test DR test platform: Site Recovery Manager (SRM) DR test network: Isolated Segment in AVS DR Migration DR migration platform: Site Recovery Manager (SRM) Protected VMs: 3 On-Prem VMs will be shutdown Recovery VMs: 3 AVS VMs will be powered on Recovery VM network: Layer 2 extended network Network extension platform: HCX DR Event Protected Site: no longer available Recovery Site: AVS Recovery VMs: all VMs come up on AVS Recovery VM network: Layer 3 segment Recovery network platform: NSX-t (part of AVS) ","date":1658856025,"description":"","lastmod":"2022-07-26T13:20:25-04:00","objectID":"878daa52e14b1c053751417cc9938f46","permalink":"https://sjainout.github.io/cloud/srm/srm_hcx_same_ip_architecture/","publishdate":"2022-07-26T13:20:25-04:00","title":"Application DR Architecture"},{"content":"Technical Notes for Cloud Services Detail Sections AVS Azure VMware Solution (IaaS) HCX Hybrid Cloud Extension (VM Migration) SRM Site Recovery Manager (DR) HORIZON Horizon in AVS (VDI) VMware References VMware Service Network Ports : to setup layer 4 firewall rules VMware Service ConfigMax: for scale limits VMware Product Download VMware Product Compatibility VMware Cloud Ready Framework (VMCRF) Other References IP Subnet Calculator ","date":1658371174,"description":"","lastmod":"2022-07-20T22:39:34-04:00","objectID":"3976528693a0108357f4928017600865","permalink":"https://sjainout.github.io/cloud/","publishdate":"2022-07-20T22:39:34-04:00","title":"Technical Notes for Cloud Services"},{"content":"Sunil Jain\nVMware Cloud Solution Architect\n(past: Cisco, SAP)\nemail\nlinkedin\n","date":1658407850,"description":"","lastmod":"2022-07-21T08:50:50-04:00","objectID":"6083a88ee3411b0d17ce02d738f69d47","permalink":"https://sjainout.github.io/cloud/about/","publishdate":"2022-07-21T08:50:50-04:00","title":"About"}]